Revit 2026 API

# ProfilePlaneLocation Enumeration

---

Indicates the location of Sweep profile plane on the path curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ProfilePlaneLocation
```
```vb
Public Enumeration ProfilePlaneLocation
```
```cpp
public enum class ProfilePlaneLocation
```
```fsharp
type ProfilePlaneLocation
```

| Member name | Value | Description |
| --- | --- | --- |
| End | 2 | Indicates the profile plane located at the End of the path curve. |
| MidPoint | 1 | Indicates the profile plane located at the Middle point of the path curve. |
| Start | 0 | Indicates the profile plane located at the start of the path curve. |

Use this enum in the NewSweep() method to create generic forms.

#### Reference

Autodesk.Revit.DB Namespace